# 请在此进行相关测试，注意运行正常后的代码提交时以每道试题一个独立的文件进行提交
"""

第一题：
请分析以下TTS程序，将其修改为一个mytts 类

import pyttsx3

# 创建一个文本转语音引擎

engine = pyttsx3.init()

# 设置语音属性（可选）

engine.setProperty('rate', 150)  # 设置语速

engine.setProperty('volume', 1)   # 设置音量（0.0到1.0）


# 要转换为语音的文本

text = "你好，欢迎使用文本转语音功能！"

# 将文本转换为语音并播放

engine.say(text)


# 等待语音播放完成

engine.runAndWait()

第二题：
请写一个基于以下字串的汉字生成程序，并将结果显示出来。

72,-64,0,-6,-7,-2,-7,-4,-2,-2,0,-2,3,-4,4,-6,3,-6,3,-64,0,-6,-7,-6,8,-6,8,-64,0,-1,-7,8,-7,8,-7,-64,0,6,-7,6,7,4,7,4,7,-64,0,0,-3,0,2,0,2,-64,0,0,-3,3,-3,3,3,

第三题：
略

第四题：

利用建立数据字典的方法，分析汉字“明””张“和”吴“的组成结构，并用语音输出这样一句话：

 汉字明由日和月两部分组成，日月为明。

 汉字吴由口和天两部分组成，口天为吴。

 汉字张由弓和长两部分组织，弓长为张

 第五题：

 请结合第3和第4题，利用已经学习过的机器学习算法，自己编写一道对汉字或部件进行分类的试题，并与出计算结果
"""
